Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/nxp/devices/lpc54018/drivers/fsl_sctimer.h
        case kSCTIMER_Counter_U:
            assert(1U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));
            /* Use Counter_L bits when counter is operating in 32-bit mode (unify counter). */
            value = base->COUNT;
            break;

        default:
            /* Fix the MISRA C-2012 issue rule 16.4. */
            break;
    }

    return value;
}

/*!
 * @brief Set the event bit field of STATE register.
 *
 * The function is to set the event bit field of STATE register. Writing to the STATE_L, STATE_H, or unified register
 * is only allowed when the corresponding counter is halted (HALT bits are set to 1 in the CTRL register).
 *
 * @param base         SCTimer peripheral base address
 * @param whichCounter SCTimer counter to use. In 16-bit mode, we can select Counter_L and Counter_H,
 *                      In 32-bit mode, we can select Counter_U.
 * @param event        the event bit field of STATE register need to be set (only support from bit 0 to bit 4).
 */
static inline void SCTIMER_SetEventInState(SCT_Type *base, sctimer_counter_t whichCounter, uint32_t event)
{
    /* SCT only support 5 events set to variable or not. */
    assert(event < 5U);

    SCTIMER_StopTimer(base, whichCounter);

    switch (whichCounter)
    {
        case kSCTIMER_Counter_L:
            assert(0U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));
            /* Use STATE_L bits when user wants to setup the Low counter */
            base->STATE_ACCESS16BIT.STATEL |= SCT_STATEL_STATEL((uint16_t)1U << event);
            break;

        case kSCTIMER_Counter_H:
            assert(0U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));
            /* Use STATE_H bits when user wants to start the High counter */
            base->STATE_ACCESS16BIT.STATEH |= SCT_STATEH_STATEH((uint16_t)1U << event);
            break;

        case kSCTIMER_Counter_U:
            assert(1U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));
            /* Use STATE_L bits when counter is operating in 32-bit mode (unify counter). */
            base->STATE |= SCT_STATE_STATE_L((uint32_t)1U << event);
            break;

        default:
            /* Fix the MISRA C-2012 issue rule 16.4. */
            break;
    }

    SCTIMER_StartTimer(base, whichCounter);
}

/*!
 * @brief Clear the event bit field of STATE register.
 *
 * The function is to clear the event bit field of STATE register. Writing to the STATE_L, STATE_H, or unified
 * register is only allowed when the corresponding counter is halted (HALT bits are set to 1 in the CTRL register).
 *
 * @param base         SCTimer peripheral base address
 * @param whichCounter SCTimer counter to use. In 16-bit mode, we can select Counter_L and Counter_H,
 *                      In 32-bit mode, we can select Counter_U.
 * @param event        the event bit field of STATE register need to be set (only support from bit 0 to bit 4).
 */
static inline void SCTIMER_ClearEventInState(SCT_Type *base, sctimer_counter_t whichCounter, uint32_t event)
{
    /* SCT only support 5 events set to variable or not. */
    assert(event < 5U);

    SCTIMER_StopTimer(base, whichCounter);

    switch (whichCounter)
    {
        case kSCTIMER_Counter_L:
            assert(0U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));
            /* Use STATE_L bits when user wants to setup the Low counter */
            base->STATE_ACCESS16BIT.STATEL &= ~(SCT_STATEL_STATEL((uint16_t)1U << event));
            break;

        case kSCTIMER_Counter_H:
            assert(0U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));
            /* Use STATE_H bits when user wants to start the High counter */
            base->STATE_ACCESS16BIT.STATEH &= ~(SCT_STATEH_STATEH((uint16_t)1U << event));
            break;

        case kSCTIMER_Counter_U:
            assert(1U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));
            /* Use STATE_L bits when counter is operating in 32-bit mode (unify counter). */
            base->STATE &= ~(SCT_STATE_STATE_L((uint32_t)1U << event));
            break;

        default:
            /* Fix the MISRA C-2012 issue rule 16.4. */
            break;
    }

    SCTIMER_StartTimer(base, whichCounter);
}

/*!
 * @brief Get the event bit field of STATE register.
 *
 * The function is to get the event bit field of STATE register. Writing to the STATE_L, STATE_H, or unified register
 * is only allowed when the corresponding counter is halted (HALT bits are set to 1 in the CTRL register).
 *
 * @param base         SCTimer peripheral base address
 * @param whichCounter SCTimer counter to use. In 16-bit mode, we can select Counter_L and Counter_H,
 *                      In 32-bit mode, we can select Counter_U.
 * @param event        the event bit field of STATE register need to be set (only support from bit 0 to bit 4).
 * @return The the event bit field of STATE register.
 *                      - true: The event bit field of STATE register set.
 *                      - false: The event bit field of STATE register cleared.
 */
static inline bool SCTIMER_GetEventInState(SCT_Type *base, sctimer_counter_t whichCounter, uint32_t event)
{
    /* SCT only support 5 events set to variable or not. */
    assert(event < 5U);

    bool fgEnable;

    switch (whichCounter)
    {
        case kSCTIMER_Counter_L:
            assert(0U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));
            /* Use STATE_L bits when user wants to setup the Low counter */
            fgEnable = (0U == (base->STATE_ACCESS16BIT.STATEL & SCT_STATEL_STATEL((uint16_t)1U << event)));
            break;

        case kSCTIMER_Counter_H:
            assert(0U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));
            /* Use STATE_H bits when user wants to start the High counter */
            fgEnable = (0U == (base->STATE_ACCESS16BIT.STATEH & SCT_STATEH_STATEH((uint16_t)1U << event)));
            break;

        case kSCTIMER_Counter_U:
            assert(1U == (base->CONFIG & SCT_CONFIG_UNIFY_MASK));
            /* Use STATE_L bits when counter is operating in 32-bit mode (unify counter). */
            fgEnable = (0U == (base->STATE & SCT_STATE_STATE_L((uint32_t)1U << event)));
            break;

        default:
            /* Fix the MISRA C-2012 issue rule 16.4. */
            break;
    }

    return fgEnable;
}

/*!
 * @brief SCTimer interrupt handler.
 *
 * @param base SCTimer peripheral base address.
 */
void SCTIMER_EventHandleIRQ(SCT_Type *base);

/*! @}*/

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* _FSL_SCTIMER_H_ */
